# helpers.py

#+begin_src org
  This is a meta file from which are generated source files.
#+end_src

*** setup

~Ctrl-C Ctrl-C~
#+begin_src sh
  # One time setup for ical2json
  pipenv install flask requests icalendar
#+end_src

#+RESULTS:
| To             | activate        | this      | project's    | virtualenv, | run | pipenv     | shell. |        |      |
| Alternatively, | run             | a         | command      | inside      | the | virtualenv | with   | pipenv | run. |
| Installing     | flask...        |           |              |             |     |            |        |        |      |
| ✔              | Installation    | Succeeded |              |             |     |            |        |        |      |
| Installing     | requests...     |           |              |             |     |            |        |        |      |
| ✔              | Installation    | Succeeded |              |             |     |            |        |        |      |
| Installing     | icalendar...    |           |              |             |     |            |        |        |      |
| ✔              | Installation    | Succeeded |              |             |     |            |        |        |      |
| To             | activate        | this      | project's    | virtualenv, | run | pipenv     | shell. |        |      |
| Alternatively, | run             | a         | command      | inside      | the | virtualenv | with   | pipenv | run. |
| Installing     | dependencies    | from      | Pipfile.lock | (da8323)... |     |            |        |        |      |
| All            | dependencies    | are       | now          | up-to-date! |     |            |        |        |      |
| Building       | requirements... |           |              |             |     |            |        |        |      |
| Resolving      | dependencies... |           |              |             |     |            |        |        |      |
| ✔              | Success!        |           |              |             |     |            |        |        |      |
| To             | activate        | this      | project's    | virtualenv, | run | pipenv     | shell. |        |      |
| Alternatively, | run             | a         | command      | inside      | the | virtualenv | with   | pipenv | run. |
| Installing     | dependencies    | from      | Pipfile.lock | (b85116)... |     |            |        |        |      |
| All            | dependencies    | are       | now          | up-to-date! |     |            |        |        |      |
| Installing     | dependencies    | from      | Pipfile.lock | (b85116)... |     |            |        |        |      |

#+begin_src sh
  chmod +x ./py/ical2json.py
#+end_src

#+begin_src sh
  chmod +x ./sh/ical2json.example.sh
#+end_src

